In [3]:
%pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Collecting pandas
  Using cached pandas-2.3.3-cp39-cp39-macosx_11_0_arm64.whl (10.8 MB)
Collecting pytz>=2020.1
  Using cached pytz-2025.2-py2.py3-none-any.whl (509 kB)
Requirement already satisfied: python-dateutil>=2.8.2 in /Users/danialmendigali/Library/Python/3.9/lib/python/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: tzdata>=2022.7 in /Users/danialmendigali/Library/Python/3.9/lib/python/site-packages (from pandas) (2025.2)
Collecting numpy>=1.22.4
  Using cached numpy-2.0.2-cp39-cp39-macosx_14_0_arm64.whl (5.3 MB)
Requirement already satisfied: six>=1.5 in /Library/Developer/CommandLineTools/Library/Frameworks/Python3.framework/Versions/3.9/lib/python3.9/site-packages (from python-dateutil>=2.8.2->pandas) (1.15.0)
Installing collected packages: pytz, numpy, pandas
Successfully installed numpy-2.0.2 pandas-2.3.3 pytz-2025.2
WARNING: You are using pip version 21.2.4; however, version 25.3 is available.
You should consider upgrading via the '/Library/Developer/CommandLineTools/usr/bin/python3 -m pip install --upgrade pip' command.
Note: you may need to restart the kernel to use updated packages.

In [7]:
import pandas as pd 
import numpy as np

# 1 Creating a DataFrame 
# 1.1 Option 1

In [24]:
# creating an array 
data = np.array([[1,4], [2,5], [3,6]])

In [25]:
# creating a dataframe 
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], 
            columns=['col1', 'col2'])

In [27]:
# showing the dataframe 
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 1.2 Option 2

In [29]:
# creating an array with list shape 
data = [[1,4], [2,5], [3,6]]

In [30]:
# creating a dataframe 
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'], 
            columns=['col1', 'col2'])

In [31]:
# showing the dataframe 
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

# 2 Creating a DataFrame from a dictionary

In [34]:
# lists used for this example
states = ['California', 'Texas', 'Florida', 'New York']
population = [39614593, 297311, 21944577, 1929812]

In [35]:
# Storing lists within a dictionary 
dict_states = {'States':states, 'Population': population}

In [40]:
# Creating the dataframe 
df.population = pd.DataFrame(dict_states)

In [42]:
# showing the dataframe 
df.population

       States  Population
0  California    39614593
1       Texas      297311
2     Florida    21944577
3    New York     1929812

# 3 Creating a DataFrame from a csv file

In [44]:
# reading the csv file
df_exams = pd.read_csv('StudentsPerformance.csv')

In [45]:
df_exams

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75
...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,88,99,95
996,male,group C,high school,free/reduced,none,62,55,55
997,female,group C,high school,free/reduced,completed,59,71,65
998,female,group D,some college,standard,completed,68,78,77
999,female,group D,some college,free/reduced,none,77,86,86